app/controllers/items_controller.rb

  def index
    @items = Item.all.reverse
---
SELECT "items".* FROM "items"

  def show
    render json: Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("title", "author", "accession_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["author", "b"], ["accession_number", "c"], ["created_at", "2020-02-17 21:22:15.925884"], ["updated_at", "2020-02-17 21:22:15.925884"]]

  def update
    item = Item.find(params[:id])
    item.update(item_params)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "items" SET "title" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["title", "help"], ["updated_at", "2020-02-18 00:18:06.004271"], ["id", 22]]